results/fabio-512-run01/003_fio/cmd_216.output
io_uring_cmd-xnvme: (g=0): rw=randread, bs=(R) 512B-512B, (W) 512B-512B, (T) 512B-512B, ioengine=xnvme, iodepth=4
fio-3.32-dirty
Starting 1 thread
{
  "fio version" : "fio-3.32-dirty",
  "timestamp" : 1666751953,
  "timestamp_ms" : 1666751953498,
  "time" : "Wed Oct 26 04:39:13 2022",
  "jobs" : [
    {
      "jobname" : "io_uring_cmd-xnvme",
      "groupid" : 0,
      "error" : 0,
      "eta" : 0,
      "elapsed" : 11,
      "job options" : {
        "name" : "io_uring_cmd-xnvme",
        "rw" : "randread",
        "size" : "12G",
        "iodepth" : "4",
        "bs" : "512",
        "direct" : "0",
        "thread" : "1",
        "time_based" : "1",
        "runtime" : "7",
        "ramp_time" : "3",
        "norandommap" : "1",
        "allow_file_create" : "0",
        "ioengine" : "external:/usr/local/lib/x86_64-linux-gnu/libxnvme-fio-engine.so",
        "xnvme_be" : "linux",
        "xnvme_async" : "io_uring_cmd",
        "xnvme_sync" : "nvme",
        "xnvme_admin" : "nvme",
        "xnvme_dev_nsid" : "1",
        "filename" : "/dev/ng0n1",
        "cpus_allowed" : "1"
      },
      "read" : {
        "io_bytes" : 1122532864,
        "io_kbytes" : 1096223,
        "bw_bytes" : 160338932,
        "bw" : 156580,
        "iops" : 313161.405513,
        "runtime" : 7001,
        "total_ios" : 2192443,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 1212,
          "max" : 24466,
          "mean" : 2454.161673,
          "stddev" : 961.853907,
          "N" : 2192444
        },
        "clat_ns" : {
          "min" : 130,
          "max" : 143108,
          "mean" : 9983.846668,
          "stddev" : 2529.342162,
          "N" : 2192446,
          "percentile" : {
            "1.000000" : 7648,
            "5.000000" : 8160,
            "10.000000" : 9280,
            "20.000000" : 9280,
            "30.000000" : 9408,
            "40.000000" : 9408,
            "50.000000" : 9536,
            "60.000000" : 9536,
            "70.000000" : 9536,
            "80.000000" : 10688,
            "90.000000" : 10944,
            "95.000000" : 11072,
            "99.000000" : 22912,
            "99.500000" : 24704,
            "99.900000" : 28544,
            "99.950000" : 33536,
            "99.990000" : 71168
          }
        },
        "lat_ns" : {
          "min" : 5500,
          "max" : 144361,
          "mean" : 12438.008588,
          "stddev" : 2576.508476,
          "N" : 2192446
        },
        "bw_min" : 156329,
        "bw_max" : 156855,
        "bw_agg" : 100.000000,
        "bw_mean" : 156627.857143,
        "bw_dev" : 180.425078,
        "bw_samples" : 14,
        "iops_min" : 312658,
        "iops_max" : 313710,
        "iops_mean" : 313255.714286,
        "iops_stddev" : 361.150177,
        "iops_samples" : 14
      },
      "write" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "trim" : {
        "io_bytes" : 0,
        "io_kbytes" : 0,
        "bw_bytes" : 0,
        "bw" : 0,
        "iops" : 0.000000,
        "runtime" : 0,
        "total_ios" : 0,
        "short_ios" : 0,
        "drop_ios" : 0,
        "slat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "clat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        },
        "bw_min" : 0,
        "bw_max" : 0,
        "bw_agg" : 0.000000,
        "bw_mean" : 0.000000,
        "bw_dev" : 0.000000,
        "bw_samples" : 0,
        "iops_min" : 0,
        "iops_max" : 0,
        "iops_mean" : 0.000000,
        "iops_stddev" : 0.000000,
        "iops_samples" : 0
      },
      "sync" : {
        "total_ios" : 0,
        "lat_ns" : {
          "min" : 0,
          "max" : 0,
          "mean" : 0.000000,
          "stddev" : 0.000000,
          "N" : 0
        }
      },
      "job_runtime" : 7000,
      "usr_cpu" : 20.500000,
      "sys_cpu" : 77.171429,
      "ctx" : 12638,
      "majf" : 0,
      "minf" : 0,
      "iodepth_level" : {
        "1" : 0.000000,
        "2" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_submit" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "iodepth_complete" : {
        "0" : 0.000000,
        "4" : 100.000000,
        "8" : 0.000000,
        "16" : 0.000000,
        "32" : 0.000000,
        "64" : 0.000000,
        ">=64" : 0.000000
      },
      "latency_ns" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.010000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_us" : {
        "2" : 0.010000,
        "4" : 0.095647,
        "10" : 78.931676,
        "20" : 19.299658,
        "50" : 1.626907,
        "100" : 0.036307,
        "250" : 0.010000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000
      },
      "latency_ms" : {
        "2" : 0.000000,
        "4" : 0.000000,
        "10" : 0.000000,
        "20" : 0.000000,
        "50" : 0.000000,
        "100" : 0.000000,
        "250" : 0.000000,
        "500" : 0.000000,
        "750" : 0.000000,
        "1000" : 0.000000,
        "2000" : 0.000000,
        ">=2000" : 0.000000
      },
      "latency_depth" : 4,
      "latency_target" : 0,
      "latency_percentile" : 100.000000,
      "latency_window" : 0
    }
  ]
}

io_uring_cmd-xnvme: (groupid=0, jobs=1): err= 0: pid=141767: Wed Oct 26 04:39:13 2022
  read: IOPS=313k, BW=153MiB/s (160MB/s)(1071MiB/7001msec)
    slat (nsec): min=1212, max=24466, avg=2454.16, stdev=961.85
    clat (nsec): min=130, max=143108, avg=9983.85, stdev=2529.34
     lat (usec): min=5, max=144, avg=12.44, stdev= 2.58
    clat percentiles (nsec):
     |  1.00th=[ 7648],  5.00th=[ 8160], 10.00th=[ 9280], 20.00th=[ 9280],
     | 30.00th=[ 9408], 40.00th=[ 9408], 50.00th=[ 9536], 60.00th=[ 9536],
     | 70.00th=[ 9536], 80.00th=[10688], 90.00th=[10944], 95.00th=[11072],
     | 99.00th=[22912], 99.50th=[24704], 99.90th=[28544], 99.95th=[33536],
     | 99.99th=[71168]
   bw (  KiB/s): min=156329, max=156855, per=100.00%, avg=156627.86, stdev=180.43, samples=14
   iops        : min=312658, max=313710, avg=313255.71, stdev=361.15, samples=14
  lat (nsec)   : 250=0.01%
  lat (usec)   : 2=0.01%, 4=0.10%, 10=78.93%, 20=19.30%, 50=1.63%
  lat (usec)   : 100=0.04%, 250=0.01%
  cpu          : usr=20.50%, sys=77.17%, ctx=12638, majf=0, minf=0
  IO depths    : 1=0.0%, 2=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=2192443,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=4

Run status group 0 (all jobs):
   READ: bw=153MiB/s (160MB/s), 153MiB/s-153MiB/s (160MB/s-160MB/s), io=1071MiB (1123MB), run=7001-7001msec